#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int x;                                            // число элементов дроби

	double result = 1;                                    // Наш итоговый результат

	cout << "Введите число элементов цепной дроби: ";
	cin >> x;


	for (int i = 0; i < x; i++)
	{
		result = 1 + 1 / result;
	}

	cout << "Результат вычисления циклической дроби: " << result << endl << endl;

	system("pause");

	return 0;
}
